content/posts/wang2018.md
+++
title = "wang2018 | A Method of Robot Base Frame Calibration by Using Dual Quaternion Algebra"
author = ["João Gutemberg Farias"]
draft = false
+++

The work proposes a method for calibrating the transformation between the [inertial/world frame]({{< relref "inertial_frame" >}}) and the [robot frame]({{< relref "body_frame" >}}). It uses a sensor to measure the position of the [end-effector]({{< relref "end_link" >}}) and calibrates the dual quaternion resposible to acheive the transformation.

The result was much favorable to the dual quaternion method when compared to a quaternion method and a Procrustes Analysis. The authors credits the higher precision of dual quaternions due to the fact that it computes rotation and translation coupled, so there is no error propagation when computing one and using the result to compute the other.


## Info {#info}

When the robot is required to execute a certain task in the world coordinate system (WCS), it is necessary to find the coordinate transformation between the robot base coordinate system (RBCS) and WCS to enable the high precision motion planning. This paper presents a simple and accurate method that allows a simultaneous computation of the coordinate transformations (i.e., rotation and translation) from WCS to RBCS. Based on the dual quaternion, the robot kinematic model and formulas for calculating the transformation are derived, which allow calculating the rotation and translation simultaneously. Taking the unit dual quaternion as a constraint, the Lagrangian multiplier method is employed to obtain the optimum transformation. Both simulation and experiment results show that higher calibration precision is obtained. The proposed approach has certain reference value and guiding sense for other calibration problems.


## Notes {#notes}


### Resumo {#resumo}

The work proposes a method for calibrating the transformation between the intertial/world frame and the robot frame. It uses a sensor to measure the position of the end-effector and calibrates the dual quaternion resposible to acheive the transformation.

The result was much favorable to the dual quaternion method when compared to a quaternion method and a Procrustes Analysis. The authors credits the higher precision of dual quaternions due to the fact that it computes rotation and translation coupled, so there is no error propagation when computing one and using the result to compute the other.
